In [79]:
import pandas as pd
import numpy as np
import os
from env import host, username, password
import env
from pydataset import data

# exercises Pt.1

# Create a function named get_db_url. It should accept a username, hostname, password, and database name and return a url connection string formatted like in the example at the start of this lesson.

In [84]:
def get_db_url(host, username, password, db):
    
    '''
    return a formatted string containing username,
    password, host and db for MySQL SERVER AND DB.
    The env_file check to see if the env.py exist in current working directory
    
    '''
    return f'mysql+pymysql://{username}:{password}@{host}/{db}'
    
    # create the url variable (string) with my username, password and host inserted

In [85]:
url = get_db_url(host, username, password, 'employees')

# Use your function to obtain a connection to the employees database.

In [87]:
query = 'SELECT * FROM employees LIMIT 10'

In [88]:
pd.read_sql(query,url)

   emp_no  birth_date first_name  last_name gender   hire_date
0   10001  1953-09-02     Georgi    Facello      M  1986-06-26
1   10002  1964-06-02    Bezalel     Simmel      F  1985-11-21
2   10003  1959-12-03      Parto    Bamford      M  1986-08-28
3   10004  1954-05-01  Chirstian    Koblick      M  1986-12-01
4   10005  1955-01-21    Kyoichi   Maliniak      M  1989-09-12
5   10006  1953-04-20     Anneke    Preusig      F  1989-06-02
6   10007  1957-05-23    Tzvetan  Zielinski      F  1989-02-10
7   10008  1958-02-19     Saniya   Kalloufi      M  1994-09-15
8   10009  1952-04-19     Sumant       Peac      F  1985-02-18
9   10010  1963-06-01  Duangkaew   Piveteau      F  1989-08-24

# Once you have successfully run a query:

# a. Intentionally make a typo in the database url. What kind of error message do you see?

In [ ]:
# error out

# b. Intentionally make an error in your SQL query. What does the error message look like?

In [ ]:
#error out

# Read the employees and titles tables into two separate DataFrames.

In [89]:
emp_query = 'SELECT * FROM employees LIMIT 100'

In [91]:
employees = pd.read_sql(emp_query,url)

In [93]:
type(employees)

pandas.core.frame.DataFrame

In [51]:
tit_query = 'SELECT * FROM titles'

In [94]:
titles = pd.read_sql(tit_query,url)

In [95]:
type(titles)

pandas.core.frame.DataFrame

# How many rows and columns do you have in each DataFrame? Is that what you expected?

In [96]:
employees.shape

(100, 6)

In [99]:
titles.shape

(443308, 4)

# Display the summary statistics for each DataFrame.

In [101]:
titles.describe()

              emp_no
count  443308.000000
mean   253075.034430
std    161853.292613
min     10001.000000
25%     84855.750000
50%    249847.500000
75%    424891.250000
max    499999.000000

In [100]:
employees.describe()

             emp_no
count    100.000000
mean   10050.500000
std       29.011492
min    10001.000000
25%    10025.750000
50%    10050.500000
75%    10075.250000
max    10100.000000

# How many unique titles are in the titles DataFrame?

In [102]:
titles['title'].unique()

array(['Senior Engineer', 'Staff', 'Engineer', 'Senior Staff',
       'Assistant Engineer', 'Technique Leader', 'Manager'], dtype=object)

# What is the oldest date in the to_date column?

In [200]:
titles.sort_values("to_date").agg('min')

emp_no                    10001
title        Assistant Engineer
from_date            1985-02-18
to_date              1987-01-27
dtype: object

# what is the most recent date in the to_date column?

In [103]:
titles.groupby("to_date").agg('min').tail(2)

            emp_no               title   from_date
to_date
2002-08-01   20278  Assistant Engineer  1985-02-10
9999-01-01   10001  Assistant Engineer  1985-02-01

# exercises Pt.2

In [ ]:
# Copy the users and roles DataFrames from the examples above.

In [104]:
# Create the users DataFrame.

users = pd.DataFrame({
    'id': [1, 2, 3, 4, 5, 6],
    'name': ['bob', 'joe', 'sally', 'adam', 'jane', 'mike'],
    'role_id': [1, 2, 3, 3, np.nan, np.nan]
})
users

# Create the roles DataFrame

roles = pd.DataFrame({
    'id': [1, 2, 3, 4],
    'name': ['admin', 'author', 'reviewer', 'commenter']
})
roles

   id       name
0   1      admin
1   2     author
2   3   reviewer
3   4  commenter

In [105]:
roles = pd.DataFrame({
    'id':[1,2,3,4],
    'name':['admin','author','reviewer','commenter']

})

roles

   id       name
0   1      admin
1   2     author
2   3   reviewer
3   4  commenter

# What is the result of using a right join on the DataFrames?

In [106]:
users.merge(roles,
            left_on = "role_id",
            right_on ='id',
            how = 'right',
           indicator = True)

   id_x name_x  role_id  id_y     name_y      _merge
0   1.0    bob      1.0     1      admin        both
1   2.0    joe      2.0     2     author        both
2   3.0  sally      3.0     3   reviewer        both
3   4.0   adam      3.0     3   reviewer        both
4   NaN    NaN      NaN     4  commenter  right_only

# #What is the result of using a outer join on the DataFrames?

In [107]:
users.merge(roles,
            left_on = "role_id",
            right_on ='id',
            how = 'outer',
           indicator = True)

   id_x name_x  role_id  id_y     name_y      _merge
0   1.0    bob      1.0   1.0      admin        both
1   2.0    joe      2.0   2.0     author        both
2   3.0  sally      3.0   3.0   reviewer        both
3   4.0   adam      3.0   3.0   reviewer        both
4   5.0   jane      NaN   NaN        NaN   left_only
5   6.0   mike      NaN   NaN        NaN   left_only
6   NaN    NaN      NaN   4.0  commenter  right_only

In [ ]:
#What happens if you drop the foreign keys from the DataFrames and try to merge them?

In [108]:
(users.merge(roles,
            left_on = "role_id",
            right_on ='id',
            how = 'outer',
           indicator = True
           )
.drop(columns = "id_y")
.drop(columns = "role_id")
 
)

   id_x name_x     name_y      _merge
0   1.0    bob      admin        both
1   2.0    joe     author        both
2   3.0  sally   reviewer        both
3   4.0   adam   reviewer        both
4   5.0   jane        NaN   left_only
5   6.0   mike        NaN   left_only
6   NaN    NaN  commenter  right_only

In [ ]:
#Load the mpg dataset from PyDataset.

In [6]:
mpg = data('mpg')

In [408]:
#Output and read the documentation for the mpg dataset.

In [7]:
data('mpg', show_doc=True)

mpg

PyDataset Documentation (adopted from R Documentation. The displayed examples are in R)

## Fuel economy data from 1999 and 2008 for 38 popular models of car

### Description

This dataset contains a subset of the fuel economy data that the EPA makes
available on http://fueleconomy.gov. It contains only models which had a new
release every year between 1999 and 2008 - this was used as a proxy for the
popularity of the car.

### Usage

    data(mpg)

### Format

A data frame with 234 rows and 11 variables

### Details

  * manufacturer.

  * model.

  * displ. engine displacement, in litres

  * year.

  * cyl. number of cylinders

  * trans. type of transmission

  * drv. f = front-wheel drive, r = rear wheel drive, 4 = 4wd

  * cty. city miles per gallon

  * hwy. highway miles per gallon

  * fl.

  * class.

In [8]:
#How many rows and columns are in the dataset?
mpg.shape

(234, 11)

In [13]:
#Check out your column names and perform any cleanup you may want on them.
mpg.rename(columns={'cty': 'city'},inplace = True)
mpg.rename(columns={'hwy': 'highway'},inplace = True)

In [14]:
#Display the summary statistics for the dataset.
mpg.describe()

            displ         year         cyl        city     highway
count  234.000000   234.000000  234.000000  234.000000  234.000000
mean     3.471795  2003.500000    5.888889   16.858974   23.440171
std      1.291959     4.509646    1.611534    4.255946    5.954643
min      1.600000  1999.000000    4.000000    9.000000   12.000000
25%      2.400000  1999.000000    4.000000   14.000000   18.000000
50%      3.300000  2003.500000    6.000000   17.000000   24.000000
75%      4.600000  2008.000000    8.000000   19.000000   27.000000
max      7.000000  2008.000000    8.000000   35.000000   44.000000

In [10]:
#How many different manufacturers are there?
len(mpg.groupby("manufacturer"))

15

In [9]:
mpg['manufacturer'].nunique()

15

In [84]:
mpg.head(1)

,manufacturer,model,displ,year,cyl,trans,drv,city,highway,fl,class
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact

In [95]:
#How many different models are there?
len(mpg.groupby("model"))

38

In [11]:
mpg['model'].nunique()

38

In [98]:
#Create a column named mileage_difference like you did in the DataFrames exercises; this column should contain the difference between highway and city mileage for each car
mpg["mileage_difference"] = mpg['highway'] - mpg['city']
mpg

,manufacturer,model,displ,year,cyl,trans,drv,city,highway,fl,class,mileage_difference
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,11
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,8
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,11
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,9
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,10
...,...,...,...,...,...,...,...,...,...,...,...,...
230,volkswagen,passat,2.0,2008,4,auto(s6),f,19,28,p,midsize,9
231,volkswagen,passat,2.0,2008,4,manual(m6),f,21,29,p,midsize,8
232,volkswagen,passat,2.8,1999,6,auto(l5),f,16,26,p,midsize,10
233,volkswagen,passat,2.8,1999,6,manual(m5),f,18,26,p,midsize,8
234,volkswagen,passat,3.6,2008,6,auto(s6),f,17,26,p,midsize,9

In [15]:
 #Create a column named average_mileage like you did in the DataFrames exercises; this is the mean of the city and highway mileage.
mpg["average_mileage"] = (mpg['highway'] + mpg['city']) /2
mpg

,manufacturer,model,displ,year,cyl,trans,drv,city,highway,fl,class,average_mileage
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,23.5
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,25.0
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,25.5
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,25.5
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,21.0
...,...,...,...,...,...,...,...,...,...,...,...,...
230,volkswagen,passat,2.0,2008,4,auto(s6),f,19,28,p,midsize,23.5
231,volkswagen,passat,2.0,2008,4,manual(m6),f,21,29,p,midsize,25.0
232,volkswagen,passat,2.8,1999,6,auto(l5),f,16,26,p,midsize,21.0
233,volkswagen,passat,2.8,1999,6,manual(m5),f,18,26,p,midsize,22.0
234,volkswagen,passat,3.6,2008,6,auto(s6),f,17,26,p,midsize,21.5

In [17]:
mpg['trans'].unique()

array(['auto(l5)', 'manual(m5)', 'manual(m6)', 'auto(av)', 'auto(s6)',
       'auto(l4)', 'auto(l3)', 'auto(l6)', 'auto(s5)', 'auto(s4)'],
      dtype=object)

In [16]:
#Create a new column on the mpg dataset named is_automatic that holds boolean values denoting whether the car has an automatic transmission.
mpg["is_auto"] = (mpg["trans"].str.startswith("a"))
mpg

,manufacturer,model,displ,year,cyl,trans,drv,city,highway,fl,class,average_mileage,is_auto
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,23.5,True
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,25.0,False
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,25.5,False
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,25.5,True
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,21.0,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...
230,volkswagen,passat,2.0,2008,4,auto(s6),f,19,28,p,midsize,23.5,True
231,volkswagen,passat,2.0,2008,4,manual(m6),f,21,29,p,midsize,25.0,False
232,volkswagen,passat,2.8,1999,6,auto(l5),f,16,26,p,midsize,21.0,True
233,volkswagen,passat,2.8,1999,6,manual(m5),f,18,26,p,midsize,22.0,False
234,volkswagen,passat,3.6,2008,6,auto(s6),f,17,26,p,midsize,21.5,True

In [23]:
#Using the mpg dataset, find out which which manufacturer has the best miles per gallon on average?
mpg.groupby("manufacturer").average_mileage.mean().sort_values(ascending = False).head(1)

manufacturer
honda    28.5
Name: average_mileage, dtype: float64

In [136]:
#Do automatic or manual cars have better miles per gallon?
mpg.groupby('is_auto').average_mileage.agg(['min','max','mean'])

          min   max       mean
is_auto
False    10.5  39.5  22.227273
True     10.5  35.0  19.130573

# exercises Pt 3

 # Use your get_db_url function to help you explore the data from the chipotle database.

In [117]:
chip_url = get_db_url(host, username, password, 'chipotle')

In [119]:
chip_query = 'SELECT * FROM orders'

In [122]:
chip = pd.read_sql(chip_query,chip_url)

# What is the total price for each order?

In [123]:
chip['item_price'].str.contains(',').sum()

0

In [34]:
chip_df['item_price'] = chip_df['item_price'].str.replace('$', '')

/var/folders/d0/5dr5q0n145vcn3_m9dxy1xq80000gn/T/ipykernel_15218/3316443482.py:1: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  chip_df['item_price'] = chip_df['item_price'].str.replace('$', '')

In [124]:
chip[['item_price']] = chip_df[['item_price']].astype(float)

In [125]:
chip.groupby('order_id')['item_price'].agg('sum')

order_id
1       11.56
2       16.98
3       12.67
4       21.00
5       13.70
        ...
1830    23.00
1831    12.90
1832    13.20
1833    23.50
1834    28.75
Name: item_price, Length: 1834, dtype: float64

# What are the most popular 3 items

In [44]:
chip.groupby('item_name')['id'].count().sort_values().tail(3)

item_name
Chips and Guacamole    479
Chicken Burrito        553
Chicken Bowl           726
Name: id, dtype: int64

# Which item has produced the most revenue?

In [126]:
chip.groupby('item_name')['item_price'].agg('sum').nlargest(1)

item_name
Chicken Bowl    7342.73
Name: item_price, dtype: float64

# Join the employees and titles DataFrames together.

In [127]:
titles.head(1)

   emp_no            title   from_date     to_date
0   10001  Senior Engineer  1986-06-26  9999-01-01

In [128]:
employees.head(1)

   emp_no  birth_date first_name last_name gender   hire_date
0   10001  1953-09-02     Georgi   Facello      M  1986-06-26

In [130]:
merg_df = employees.merge(titles,
             left_on = "emp_no",
             right_on ='emp_no',
             
             indicator = True)

In [299]:
merg_df

,emp_no,birth_date,first_name,last_name,gender,hire_date,title,from_date,to_date,employed_status,_merge
0,10001,1953-09-02,Georgi,Facello,M,1986-06-26,Senior Engineer,1986-06-26,9999-01-01,quit,both
1,10002,1964-06-02,Bezalel,Simmel,F,1985-11-21,Staff,1996-08-03,9999-01-01,quit,both
2,10003,1959-12-03,Parto,Bamford,M,1986-08-28,Senior Engineer,1995-12-03,9999-01-01,quit,both
3,10004,1954-05-01,Chirstian,Koblick,M,1986-12-01,Engineer,1986-12-01,1995-12-01,quit,both
4,10004,1954-05-01,Chirstian,Koblick,M,1986-12-01,Senior Engineer,1995-12-01,9999-01-01,quit,both
5,10005,1955-01-21,Kyoichi,Maliniak,M,1989-09-12,Senior Staff,1996-09-12,9999-01-01,quit,both
6,10005,1955-01-21,Kyoichi,Maliniak,M,1989-09-12,Staff,1989-09-12,1996-09-12,quit,both
7,10006,1953-04-20,Anneke,Preusig,F,1989-06-02,Senior Engineer,1990-08-05,9999-01-01,quit,both
8,10007,1957-05-23,Tzvetan,Zielinski,F,1989-02-10,Senior Staff,1996-02-11,9999-01-01,quit,both
9,10007,1957-05-23,Tzvetan,Zielinski,F,1989-02-10,Staff,1989-02-10,1996-02-11,quit,both
10,10008,1958-02-19,Saniya,Kalloufi,M,1994-09-15,Assistant Engineer,1998-03-11,2000-07-31,quit,both
11,10009,1952-04-19,Sumant,Peac,F,1985-02-18,Assistant Engineer,1985-02-18,1990-02-18,quit,both
12,10009,1952-04-19,Sumant,Peac,F,1985-02-18,Engineer,1990-02-18,1995-02-18,quit,both
13,10009,1952-04-19,Sumant,Peac,F,1985-02-18,Senior Engineer,1995-02-18,9999-01-01,quit,both
14,10010,1963-06-01,Duangkaew,Piveteau,F,1989-08-24,Engineer,1996-11-24,9999-01-01,quit,both
15,10011,1953-11-07,Mary,Sluis,F,1990-01-22,Staff,1990-01-22,1996-11-09,quit,both
16,10012,1960-10-04,Patricio,Bridgland,M,1992-12-18,Engineer,1992-12-18,2000-12-18,quit,both
17,10012,1960-10-04,Patricio,Bridgland,M,1992-12-18,Senior Engineer,2000-12-18,9999-01-01,quit,both
18,10013,1963-06-07,Eberhardt,Terkki,M,1985-10-20,Senior Staff,1985-10-20,9999-01-01,quit,both
19,10014,1956-02-12,Berni,Genin,M,1987-03-11,Engineer,1993-12-29,9999-01-01,quit,both
20,10015,1959-08-19,Guoxiang,Nooteboom,M,1987-07-02,Senior Staff,1992-09-19,1993-08-22,quit,both
21,10016,1961-05-02,Kazuhito,Cappelletti,M,1995-01-27,Staff,1998-02-11,9999-01-01,quit,both
22,10017,1958-07-06,Cristinel,Bouloucos,F,1993-08-03,Senior Staff,2000-08-03,9999-01-01,quit,both
23,10017,1958-07-06,Cristinel,Bouloucos,F,1993-08-03,Staff,1993-08-03,2000-08-03,quit,both
24,10018,1954-06-19,Kazuhide,Peha,F,1987-04-03,Engineer,1987-04-03,1995-04-03,quit,both
25,10018,1954-06-19,Kazuhide,Peha,F,1987-04-03,Senior Engineer,1995-04-03,9999-01-01,quit,both
26,10019,1953-01-23,Lillian,Haddadi,M,1999-04-30,Staff,1999-04-30,9999-01-01,quit,both
27,10020,1952-12-24,Mayuko,Warwick,M,1991-01-26,Engineer,1997-12-30,9999-01-01,quit,both
28,10021,1960-02-20,Ramzi,Erde,M,1988-02-10,Technique Leader,1988-02-10,2002-07-15,quit,both
29,10022,1952-07-08,Shahaf,Famili,M,1995-08-22,Engineer,1999-09-03,9999-01-01,quit,both
30,10023,1953-09-29,Bojan,Montemayor,F,1989-12-17,Engineer,1999-09-27,9999-01-01,quit,both
31,10024,1958-09-05,Suzette,Pettey,F,1997-05-19,Assistant Engineer,1998-06-14,9999-01-01,quit,both
32,10025,1958-10-31,Prasadram,Heyers,M,1987-08-17,Technique Leader,1987-08-17,1997-10-15,quit,both
33,10026,1953-04-03,Yongqiao,Berztiss,M,1995-03-20,Engineer,1995-03-20,2001-03-19,quit,both
34,10026,1953-04-03,Yongqiao,Berztiss,M,1995-03-20,Senior Engineer,2001-03-19,9999-01-01,quit,both
35,10027,1962-07-10,Divier,Reistad,F,1989-07-07,Engineer,1995-04-02,2001-04-01,quit,both
36,10027,1962-07-10,Divier,Reistad,F,1989-07-07,Senior Engineer,2001-04-01,9999-01-01,quit,both
37,10028,1963-11-26,Domenick,Tempesti,M,1991-10-22,Engineer,1991-10-22,1998-04-06,quit,both
38,10029,1956-12-13,Otmar,Herbst,M,1985-11-20,Engineer,1991-09-18,2000-09-17,quit,both
39,10029,1956-12-13,Otmar,Herbst,M,1985-11-20,Senior Engineer,2000-09-17,9999-01-01,quit,both
40,10030,1958-07-14,Elvis,Demeyer,M,1994-02-17,Engineer,1994-02-17,2001-02-17,quit,both
41,10030,1958-07-14,Elvis,Demeyer,M,1994-02-17,Senior Engineer,2001-02-17,9999-01-01,quit,both
42,10031,1959-01-27,Karsten,Joslin,M,1991-09-01,Engineer,1991-09-01,1998-09-01,quit,both
43,10031,1959-01-27,Karsten,Joslin,M,1991-09-01,Senior Engineer,1998-09-01,9999-01-01,quit,both
44,10032,1960-08-09,Jeong,Reistad,F,1990-06-20,Engineer,1990-06-20,1995-06-20,quit,both
45,10032,1960-08-09,Jeong,Reistad,F,1990-06-20,Senior Engineer,1995-06-20,9999-01-01,quit,both
46,10033,1956-11-14,Arif,Merlo,M,1987-03-18,Technique Leader,1987-03-18,1993-03-24,quit,both
47,10034,1962-12-29,Bader,Swan,M,1988-09-21,Staff,1995-04-12,1999-10-31,quit,both
48,10035,1953-02-08,Alain,Chappelet,M,1988-09-05,Engineer,1988-09-05,1996-09-05,quit,both
49,10035,1953-02-08,Alain,Chappelet,M,1988-09-05,Senior Engineer,1996-09-05,9999-01-01,quit,both
50,10036,1959-08-10,Adamantios,Portugali,M,1992-01-03,Senior Staff,1992-04-28,9999-01-01,quit,both
51,10037,1963-07-22,Pradeep,Makrucki,M,1990-12-05,Engineer,1990-12-05,1995-12-05,quit,both
52,10037,1963-07-22,Pradeep,Makrucki,M,1990-12-05,Senior Engineer,1995-12-05,9999-01-01,quit,both
53,10038,1960-07-20,Huan,Lortz,M,1989-09-20,Senior Staff,1996-09-20,9999-01-01,quit,both
54,10038,1960-07-20,Huan,Lortz,M,1989-09-20,Staff,1989-09-20,1996-09-20,quit,both
55,10039,1959-10-01,Alejandro,Brender,M,1988-01-19,Senior Staff,1997-01-18,9999-01-01,quit,both
56,10039,1959-10-01,Alejandro,Brender,M,1988-01-19,Staff,1988-01-19,1997-01-18,quit,both
57,10040,1959-09-13,Weiyi,Meriste,F,1993-02-14,Engineer,1993-02-14,1999-02-14,quit,both
58,10040,1959-09-13,Weiyi,Meriste,F,1993-02-14,Senior Engineer,1999-02-14,9999-01-01,quit,both
59,10041,1959-08-27,Uri,Lenart,F,1989-11-12,Senior Staff,1998-11-12,9999-01-01,quit,both
60,10041,1959-08-27,Uri,Lenart,F,1989-11-12,Staff,1989-11-12,1998-11-12,quit,both
61,10042,1956-02-26,Magy,Stamatiou,F,1993-03-21,Senior Staff,2000-03-21,2000-08-10,quit,both
62,10042,1956-02-26,Magy,Stamatiou,F,1993-03-21,Staff,1993-03-21,2000-03-21,quit,both
63,10043,1960-09-19,Yishay,Tzvieli,M,1990-10-20,Engineer,1990-10-20,1997-10-20,quit,both
64,10043,1960-09-19,Yishay,Tzvieli,M,1990-10-20,Senior Engineer,1997-10-20,9999-01-01,quit,both
65,10044,1961-09-21,Mingsen,Casley,F,1994-05-21,Technique Leader,1994-05-21,9999-01-01,quit,both
66,10045,1957-08-14,Moss,Shanbhogue,M,1989-09-02,Engineer,1996-11-16,9999-01-01,quit,both
67,10046,1960-07-23,Lucien,Rosenbaum,M,1992-06-20,Senior Staff,2000-06-20,9999-01-01,quit,both
68,10046,1960-07-23,Lucien,Rosenbaum,M,1992-06-20,Staff,1992-06-20,2000-06-20,quit,both
69,10047,1952-06-29,Zvonko,Nyanchama,M,1989-03-31,Engineer,1989-03-31,1998-03-31,quit,both
70,10047,1952-06-29,Zvonko,Nyanchama,M,1989-03-31,Senior Engineer,1998-03-31,9999-01-01,quit,both
71,10048,1963-07-11,Florian,Syrotiuk,M,1985-02-24,Engineer,1985-02-24,1987-01-27,quit,both
72,10049,1961-04-24,Basil,Tramer,F,1992-05-04,Senior Staff,2000-05-04,9999-01-01,quit,both
73,10049,1961-04-24,Basil,Tramer,F,1992-05-04,Staff,1992-05-04,2000-05-04,quit,both
74,10050,1958-05-21,Yinghua,Dredge,M,1990-12-25,Senior Staff,1999-12-25,9999-01-01,quit,both
75,10050,1958-05-21,Yinghua,Dredge,M,1990-12-25,Staff,1990-12-25,1999-12-25,quit,both
76,10051,1953-07-28,Hidefumi,Caine,M,1992-10-15,Engineer,1992-10-15,1998-10-15,quit,both
77,10051,1953-07-28,Hidefumi,Caine,M,1992-10-15,Senior Engineer,1998-10-15,9999-01-01,quit,both
78,10052,1961-02-26,Heping,Nitsch,M,1988-05-21,Senior Staff,2002-01-31,9999-01-01,quit,both
79,10052,1961-02-26,Heping,Nitsch,M,1988-05-21,Staff,1997-01-31,2002-01-31,quit,both
80,10053,1954-09-13,Sanjiv,Zschoche,F,1986-02-04,Senior Staff,1994-11-13,9999-01-01,quit,both
81,10054,1957-04-04,Mayumi,Schueller,M,1995-03-13,Senior Staff,2000-07-28,9999-01-01,quit,both
82,10054,1957-04-04,Mayumi,Schueller,M,1995-03-13,Staff,1995-07-29,2000-07-28,quit,both
83,10055,1956-06-06,Georgy,Dredge,M,1992-04-27,Staff,1992-04-27,1995-07-22,quit,both
84,10056,1961-09-01,Brendon,Bernini,F,1990-02-01,Engineer,1990-02-01,1999-02-01,quit,both
85,10056,1961-09-01,Brendon,Bernini,F,1990-02-01,Senior Engineer,1999-02-01,9999-01-01,quit,both
86,10057,1954-05-30,Ebbe,Callaway,F,1992-01-15,Engineer,1992-01-15,2000-01-15,quit,both
87,10057,1954-05-30,Ebbe,Callaway,F,1992-01-15,Senior Engineer,2000-01-15,9999-01-01,quit,both
88,10058,1954-10-01,Berhard,McFarlin,M,1987-04-13,Senior Staff,1988-04-25,9999-01-01,quit,both
89,10059,1953-09-19,Alejandro,McAlpine,F,1991-06-26,Senior Staff,1991-06-26,9999-01-01,quit,both
90,10060,1961-10-15,Breannda,Billingsley,M,1987-11-02,Senior Staff,1996-05-28,9999-01-01,quit,both
91,10060,1961-10-15,Breannda,Billingsley,M,1987-11-02,Staff,1989-05-28,1996-05-28,quit,both
92,10061,1962-10-19,Tse,Herber,M,1985-09-17,Senior Staff,1989-12-02,9999-01-01,quit,both
93,10062,1961-11-02,Anoosh,Peyn,M,1991-08-30,Engineer,1991-08-30,1999-08-30,quit,both
94,10062,1961-11-02,Anoosh,Peyn,M,1991-08-30,Senior Engineer,1999-08-30,9999-01-01,quit,both
95,10063,1952-08-06,Gino,Leonhardt,F,1989-04-08,Senior Engineer,1989-04-08,9999-01-01,quit,both
96,10064,1959-04-07,Udi,Jansch,M,1985-11-20,Staff,1985-11-20,1992-03-02,quit,both
97,10065,1963-04-14,Satosi,Awdeh,M,1988-05-18,Engineer,1998-05-24,9999-01-01,quit,both
98,10066,1952-11-13,Kwee,Schusler,M,1986-02-26,Assistant Engineer,1986-02-26,1992-02-26,quit,both
99,10066,1952-11-13,Kwee,Schusler,M,1986-02-26,Engineer,1992-02-26,1998-02-25,quit,both


# For each title, find the hire date of the employee that was hired most recently with that title.

In [131]:
merg_df['hire_date'] = pd.to_datetime(merg_df['hire_date'])
merg_df['birth_date'] = pd.to_datetime(merg_df['birth_date'])

merg_df['from_date'] = pd.to_datetime(merg_df['from_date'])

In [132]:
merg_df.groupby('title').hire_date.agg(max)

title
Assistant Engineer   1997-05-19
Engineer             1995-12-15
Senior Engineer      1995-12-15
Senior Staff         1995-03-13
Staff                1999-04-30
Technique Leader     1994-05-21
Name: hire_date, dtype: datetime64[ns]

# Write the code necessary to create a cross tabulation of the number of titles by department. (Hint: this will involve a combination of SQL code to pull the necessary data and python/pandas code to perform the manipulations.)

In [134]:
cross_query = '''
            SELECT t.title, d.dept_name
            FROM dept_emp
            JOIN titles t USING(emp_no)
            JOIN departments d USING(dept_no)
            WHERE t.to_date > NOW();
            '''

In [135]:
cross_url = get_db_url(host, username, password, 'employees')

In [136]:
df_cross = pd.read_sql(cross_query, cross_url)

df_cross.head()

             title        dept_name
0  Senior Engineer      Development
1            Staff            Sales
2  Senior Engineer       Production
3  Senior Engineer       Production
4     Senior Staff  Human Resources

In [139]:
pd.crosstab(df_cross['title'],df_cross['dept_name'].T)

dept_name,Customer Service,Development,Finance,Human Resources,Marketing,Production,Quality Management,Research,Sales
title,,,,,,,,,
Assistant Engineer,68,1833,0,0,0,1542,433,77,0
Engineer,627,15677,0,0,0,13325,3744,830,0
Manager,1,1,1,1,1,1,1,1,1
Senior Engineer,1790,43364,0,0,0,37156,10390,2250,0
Senior Staff,12349,1085,10650,10843,12371,1123,0,10219,32032
Staff,3902,315,3199,3416,3880,349,0,3206,9967
Technique Leader,241,6117,0,0,0,5210,1422,321,0